In [ ]:
'''
Basic DataFrame Operations
    - Display the  Data Frame
    - Print information about the data
    - Shape of the Dataframe
    - Print first 5 Rows or Observation
    - Print last 5 Rows or Observation
    - Check Whether the Object is empty or not
    - Check number of dimensions of the object
    - Number of elements in the DataFrame.
    - Returns the actual data in the DataFrame as an ND Array.
    - Transpose of the Dataframe
    - Find any null values in the DataFrame
    - Find the Null values on the data Frame Column wise
    - Find the null values on the data frame row wise
    - Iterate over through the Dataframe
    
Column Operations
    - Find total columns in the Dataframe
    - Get All the columns on the Data Frame
    - Get the Column Name
    - Check the Data Type of Columns
    - Get Unique values in the Column
    - Get Specific column
    - Get only the Specific Columns
    - Selecting columns by data type
    - Rename a Single Column
    - Rename Columns 
    - Delete column in the DataFrame
    - Add new column in the DataFrame
    - Get the Count of Unique elements in the column
    - 
    
Sorting in Columns
    - Ascending
    - Descending
    - Multiple column
    
Row Operations:
    - Add new data on the dataframe
    - Delete rows of data
    - Adding new rows from different dataframe
    - Get only the rows where nulll values on specific column 
    - Drop duplicate rows
    - Add rows to Existing Data Frame

In [2]:
import warnings
warnings.filterwarnings("ignore")

## Basic DataFrame Operations

In [4]:
import pandas as pd
import numpy as np

dict = {"Name":["Santhosh","Anand","Sreedevi",'Prashanth','Sachin'],
        "Age":[32,34,31,30,35],
        "Sex":["Male","Male","Female","Male","Male"],
        "Company":["Microsft","Google","Facebook","Tesla","Volvo"],
        "Grade":["P1","P2","P1","P3","P1"]}

df = pd.DataFrame(dict)

# Display DataFrame
df

        Name  Age     Sex   Company Grade
0   Santhosh   32    Male  Microsft    P1
1      Anand   34    Male    Google    P2
2   Sreedevi   31  Female  Facebook    P1
3  Prashanth   30    Male     Tesla    P3
4     Sachin   35    Male     Volvo    P1

In [5]:

# Print information about the data

df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 5 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Name     5 non-null      object
 1   Age      5 non-null      int64
 2   Sex      5 non-null      object
 3   Company  5 non-null      object
 4   Grade    5 non-null      object
dtypes: int64(1), object(4)
memory usage: 328.0+ bytes

In [7]:
# Shape of the Dataframe

df.shape

(5, 5)

In [9]:
# Print first 5 Rows or Observation

df.head(4)

        Name  Age     Sex   Company Grade
0   Santhosh   32    Male  Microsft    P1
1      Anand   34    Male    Google    P2
2   Sreedevi   31  Female  Facebook    P1
3  Prashanth   30    Male     Tesla    P3

In [11]:
# Print last 5 Rows or Observation

df.tail(3)

        Name  Age     Sex   Company Grade
2   Sreedevi   31  Female  Facebook    P1
3  Prashanth   30    Male     Tesla    P3
4     Sachin   35    Male     Volvo    P1

In [16]:
# Check Whether the Object is empty or not
df.empty

False

In [12]:
# Check number of dimensions of the object

df.ndim

2

In [13]:
# Number of elements in the DataFrame.
df.size

25

In [17]:
# Returns the actual data in the DataFrame as an ND Array.
df.values

array([['Santhosh', 32, 'Male', 'Microsft', 'P1'],
       ['Anand', 34, 'Male', 'Google', 'P2'],
       ['Sreedevi', 31, 'Female', 'Facebook', 'P1'],
       ['Prashanth', 30, 'Male', 'Tesla', 'P3'],
       ['Sachin', 35, 'Male', 'Volvo', 'P1']], dtype=object)

In [ ]:
# Transpose of the Dataframe

In [14]:
df.T

                0       1         2          3       4
Name     Santhosh   Anand  Sreedevi  Prashanth  Sachin
Age            32      34        31         30      35
Sex          Male    Male    Female       Male    Male
Company  Microsft  Google  Facebook      Tesla   Volvo
Grade          P1      P2        P1         P3      P1

In [ ]:
# Find any null values in the DataFrame

In [15]:
df.isnull()

    Name    Age    Sex  Company  Grade
0  False  False  False    False  False
1  False  False  False    False  False
2  False  False  False    False  False
3  False  False  False    False  False
4  False  False  False    False  False

In [19]:
# Find the Null values on the data Frame Column wise

df.isnull().any(axis=0)

Name       False
Age        False
Sex        False
Company    False
Grade      False
dtype: bool

In [21]:
# Find the null values on the data frame row wise

df.isnull().any(axis=1)

0    False
1    False
2    False
3    False
4    False
dtype: bool

In [28]:
# Iterate over through the Dataframe

for index,row in df.iterrows():
    print("{0}:-{1}".format(row['Name'],row['Company']))

Santhosh:-Microsft
Anand:-Google
Sreedevi:-Facebook
Prashanth:-Tesla
Sachin:-Volvo

In [ ]:
## Get the DataTypes

In [18]:
df.dtypes

Name       object
Age         int64
Sex        object
Company    object
Grade      object
dtype: object

## Column Operations

In [29]:
df

        Name  Age     Sex   Company Grade
0   Santhosh   32    Male  Microsft    P1
1      Anand   34    Male    Google    P2
2   Sreedevi   31  Female  Facebook    P1
3  Prashanth   30    Male     Tesla    P3
4     Sachin   35    Male     Volvo    P1

In [30]:
# Get All the columns on the Data Frame

df.columns

Index(['Name', 'Age', 'Sex', 'Company', 'Grade'], dtype='object')

In [32]:
# Find total columns in the Dataframe

len(df.columns)

5

In [36]:
# Get the Column Name

list(df.columns)

['Name', 'Age', 'Sex', 'Company', 'Grade']

In [37]:
# Check the Data Type of Columns

df.dtypes

Name       object
Age         int64
Sex        object
Company    object
Grade      object
dtype: object

In [39]:
# Get Unique values in the Column
df.Sex.unique()

array(['Male', 'Female'], dtype=object)

In [40]:
# Get Specific column
df['Name']

0     Santhosh
1        Anand
2     Sreedevi
3    Prashanth
4       Sachin
Name: Name, dtype: object

In [41]:
df.Name

0     Santhosh
1        Anand
2     Sreedevi
3    Prashanth
4       Sachin
Name: Name, dtype: object

In [42]:
# Get only the Specific Columns

df[['Name','Sex']]

        Name     Sex
0   Santhosh    Male
1      Anand    Male
2   Sreedevi  Female
3  Prashanth    Male
4     Sachin    Male

In [43]:
# Selecting columns by data type

df.select_dtypes(include='number')

   Age
0   32
1   34
2   31
3   30
4   35

In [46]:
# Rename Columns

df1 = pd.DataFrame({
    'col1': ['A', 'A', 'B', np.nan, 'D', 'C'],
    'col2': [2, 1, 9, 8, 7, 4],
    'col3': [0, 1, 9, 4, 2, 3],
    'col4': ['a', 'B', 'c', 'D', 'e', 'F']
})

df1

  col1  col2  col3 col4
0    A     2     0    a
1    A     1     1    B
2    B     9     9    c
3  NaN     8     4    D
4    D     7     2    e
5    C     4     3    F

In [47]:
df1 = df1.rename(columns={'col1':'Column1 ','col2':'Column2 ','col3':'Column3 ','col4':'Column4 '})

df1

  Column1   Column2   Column3  Column4
0        A         2         0        a
1        A         1         1        B
2        B         9         9        c
3      NaN         8         4        D
4        D         7         2        e
5        C         4         3        F

In [49]:
# Delete column in the DataFrame

columsn = ['Column2 ','Column4 ']

df1.drop(columsn,axis=1,inplace=True)

# Check whether Columns are droped
df1

  Column1   Column3
0        A         0
1        A         1
2        B         9
3      NaN         4
4        D         2
5        C         3

In [51]:
# Column Deletion using 'del' function

del df1['Column1 ']

df1

   Column3
0         0
1         1
2         9
3         4
4         2
5         3

In [53]:
# Column Deletion using 'pop ' function

df1.pop('Column3 ')

df1

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4, 5]

In [56]:
# Add new column in the DataFrame

df1['Column4'] = ['5', '3', '2', '0','1','6']

df1

  Column4
0       5
1       3
2       2
3       0
4       1
5       6

In [59]:
df1 = pd.DataFrame({
    'col1': ['A', 'A', 'B', np.nan, 'D', 'C'],
    'col2': [2, 1, 9, 8, 7, 4],
    'col3': [0, 1, 9, 4, 2, 3],
    'col4': ['a', 'B', 'c', 'D', 'e', 'F']
})

df1

  col1  col2  col3 col4
0    A     2     0    a
1    A     1     1    B
2    B     9     9    c
3  NaN     8     4    D
4    D     7     2    e
5    C     4     3    F

In [58]:
# Get the Count of Unique elements in the column

df1.col1.value_counts()

A    2
B    1
D    1
C    1
Name: col1, dtype: int64

## Sorting in Columns

In [60]:
df1

  col1  col2  col3 col4
0    A     2     0    a
1    A     1     1    B
2    B     9     9    c
3  NaN     8     4    D
4    D     7     2    e
5    C     4     3    F

In [62]:
# Sort by index

df1.sort_index()

  col1  col2  col3 col4
0    A     2     0    a
1    A     1     1    B
2    B     9     9    c
3  NaN     8     4    D
4    D     7     2    e
5    C     4     3    F

In [63]:
# Sort by index witha descending

df1.sort_index(ascending=False)

  col1  col2  col3 col4
5    C     4     3    F
4    D     7     2    e
3  NaN     8     4    D
2    B     9     9    c
1    A     1     1    B
0    A     2     0    a

In [64]:
# Sorting  : Single Column

df1.sort_values('col2')

  col1  col2  col3 col4
1    A     1     1    B
0    A     2     0    a
5    C     4     3    F
4    D     7     2    e
3  NaN     8     4    D
2    B     9     9    c

In [65]:
# Sorting  : Single Column and Descending

df1.sort_values('col2',ascending=False)

  col1  col2  col3 col4
2    B     9     9    c
3  NaN     8     4    D
4    D     7     2    e
5    C     4     3    F
0    A     2     0    a
1    A     1     1    B

In [67]:
# Putting NAs first while Sorting
df1.sort_values(by='col1', ascending=False, na_position='first')

  col1  col2  col3 col4
3  NaN     8     4    D
4    D     7     2    e
5    C     4     3    F
2    B     9     9    c
0    A     2     0    a
1    A     1     1    B

In [69]:
# Sorting with a key function

df1.sort_values(by='col4', key=lambda col: col.str.lower())

  col1  col2  col3 col4
0    A     2     0    a
1    A     1     1    B
2    B     9     9    c
3  NaN     8     4    D
4    D     7     2    e
5    C     4     3    F

In [70]:
# Sorting  : Multiple Column with ascending

df1.sort_values(by=['col1', 'col2'],ascending=[False,True])

  col1  col2  col3 col4
4    D     7     2    e
5    C     4     3    F
2    B     9     9    c
1    A     1     1    B
0    A     2     0    a
3  NaN     8     4    D

## Row Operations:

In [71]:
df1

  col1  col2  col3 col4
0    A     2     0    a
1    A     1     1    B
2    B     9     9    c
3  NaN     8     4    D
4    D     7     2    e
5    C     4     3    F

In [85]:
df1[:4]

  col1 col2
0    A    2
2    B    9
4    D    7
5    C    4

In [73]:
# Delete rows of data

rows = [2,3]

df1.drop(rows,axis=0,inplace=True)

df1 #Check whether specified rows are droped

  col1  col2  col3 col4
0    A     2     0    a
1    A     1     1    B
4    D     7     2    e
5    C     4     3    F

In [75]:
# Addition of Rows from different Data frames

df1 = pd.DataFrame({'col1': ['A', 'A', 'B', np.nan, 'D', 'C'],'col2': [2, 1, 9, 8, 7, 4]})

df2= pd.DataFrame({'col1': [0, 1, 9, 4, 2, 3],'col2': ['a', 'B', 'c', 'D', 'e', 'F']})

df1= df1.append(df2)

df1

  col1 col2
0    A    2
1    A    1
2    B    9
3  NaN    8
4    D    7
5    C    4
0    0    a
1    1    B
2    9    c
3    4    D
4    2    e
5    3    F

In [77]:
# Get only the rows where nulll values on specific column

df1[df1['col1'].isnull()]

  col1 col2
3  NaN    8

In [78]:
df1

  col1 col2
0    A    2
1    A    1
2    B    9
3  NaN    8
4    D    7
5    C    4
0    0    a
1    1    B
2    9    c
3    4    D
4    2    e
5    3    F

In [79]:
# 14.Removing the Rows 0 and 1

rows = [1, 3]
df1.drop(rows, axis=0, inplace=True)

df1

  col1 col2
0    A    2
2    B    9
4    D    7
5    C    4
0    0    a
2    9    c
4    2    e
5    3    F

In [83]:
# Iterate through the rows

for index, row in df1.iterrows():
    print(index, row.col1, row.col2)  # get index; col1 and col2 values

0 A 2
2 B 9
4 D 7
5 C 4
0 0 a
2 9 c
4 2 e
5 3 F

In [116]:
# Check for the null row wise

df1.isnull().any(axis=1)

0    False
2    False
4    False
5    False
0    False
2    False
4    False
5    False
dtype: bool

In [117]:
df1

  col1 col2
0    A    2
2    B    9
4    D    7
5    C    4
0    0    a
2    9    c
4    2    e
5    3    F

In [133]:
##  view duplicate rows

data = [{'Name': 'Santhosh', 'Age':32, 'Company':'Microsft'},
        {'Name': 'Anand', 'Age':34, 'Company':'Google'},
        {'Name': 'Sreedevi', 'Age':31, 'Company':'Facebook'},
        {'Name': 'Prashanth', 'Age':30, 'Company':'Testla'},
        {'Name': 'Sachin', 'Age':35, 'Company':'Volvo'},
        {'Name': 'Anand', 'Age':34, 'Company':'Google'}]

df = pd.DataFrame(data)

df

        Name  Age   Company
0   Santhosh   32  Microsft
1      Anand   34    Google
2   Sreedevi   31  Facebook
3  Prashanth   30    Testla
4     Sachin   35     Volvo
5      Anand   34    Google

In [134]:
duplicate = df[df.duplicated()]

duplicate

    Name  Age Company
5  Anand   34  Google

In [136]:
# Removing duplicate rows

# dropping ALL duplicate values (keep = False)
# drop duplicates but keep one last entry (keep='last')
df.drop_duplicates(keep = 'last', inplace = True)

df

        Name  Age   Company
0   Santhosh   32  Microsft
2   Sreedevi   31  Facebook
3  Prashanth   30    Testla
4     Sachin   35     Volvo
5      Anand   34    Google

In [137]:
## Add rows to Existing Data Frame
df.append({'Name': "Harsha","Age":32,"Company":"Philips"}, ignore_index=True)

        Name  Age   Company
0   Santhosh   32  Microsft
1   Sreedevi   31  Facebook
2  Prashanth   30    Testla
3     Sachin   35     Volvo
4      Anand   34    Google
5     Harsha   32   Philips

In [138]:
# selectng row by Integrer index 
print(df.iloc[2])

Name       Prashanth
Age               30
Company       Testla
Name: 3, dtype: object